{
  "irVersion": "1.0",
  "project": "pidl",
  "repository": "https://github.com/grokify/pidl",
  "versioning": "semver",
  "commitConvention": "conventional",
  "maintainers": ["grokify"],
  "releases": [
    {
      "version": "v0.2.0",
      "date": "2025-04-18",
      "highlights": [
        { "description": "Add annotations, alternatives, conditions, notes, and nested phases to PIDL" },
        { "description": "Enhanced renderers with support for alt/else blocks, opt conditionals, and nested phase visualization" },
        { "description": "Comprehensive validation for phase hierarchies and new flow features" }
      ],
      "added": [
        { "description": "AnnotationType enum: security, performance, deprecated, info, warning, error", "commit": "843c18d" },
        { "description": "Annotation type with Type, Text, and Details fields", "commit": "843c18d" },
        { "description": "Alternative type for alternative/error flow paths", "commit": "843c18d" },
        { "description": "Phase.Parent field for nested phase hierarchies", "commit": "843c18d" },
        { "description": "Flow.Condition field for conditional flows (when clause)", "commit": "843c18d" },
        { "description": "Flow.Note field for visible diagram notes", "commit": "843c18d" },
        { "description": "Flow.Annotations field for typed annotations", "commit": "843c18d" },
        { "description": "Flow.Alternatives field for alternative paths", "commit": "843c18d" },
        { "description": "Protocol.RootPhases(), ChildPhases(), PhaseDepth() helper methods", "commit": "843c18d" },
        { "description": "Flow.HasCondition(), HasNote(), HasAnnotations(), HasAlternatives() helper methods", "commit": "843c18d" },
        { "description": "IsValidAnnotationType() validation function", "commit": "843c18d" },
        { "description": "JSON Schema definitions for annotation and alternative types", "commit": "fffad47" },
        { "description": "Phase parent reference validation with cycle detection", "commit": "37afe81" },
        { "description": "Annotation type and text validation", "commit": "37afe81" },
        { "description": "Alternative condition and flows validation", "commit": "37afe81" },
        { "description": "Mermaid opt blocks for conditional flows", "commit": "ab82c3b" },
        { "description": "Mermaid alt/else blocks for alternatives", "commit": "ab82c3b" },
        { "description": "Mermaid note right of for flow notes and annotations", "commit": "ab82c3b" },
        { "description": "Mermaid colored rect blocks for nested phases", "commit": "ab82c3b" },
        { "description": "PlantUML opt/alt/else blocks for conditionals and alternatives", "commit": "ab82c3b" },
        { "description": "PlantUML colored box containers for nested phases", "commit": "ab82c3b" },
        { "description": "D2 condition label prefixes and grouped alternatives", "commit": "ab82c3b" },
        { "description": "D2 nested phase groups with hierarchy support", "commit": "ab82c3b" },
        { "description": "DOT condition edge labels and alternative edges", "commit": "ab82c3b" }
      ],
      "tests": [
        { "description": "Tests for nested phases, phase parent validation, circular hierarchy detection", "commit": "d9dd392" },
        { "description": "Tests for annotation types and text validation", "commit": "d9dd392" },
        { "description": "Tests for alternative flows, conditions, and entity references", "commit": "d9dd392" },
        { "description": "Tests for flow helper methods (HasCondition, HasNote, etc.)", "commit": "d9dd392" },
        { "description": "Tests for phase hierarchy helpers (RootPhases, ChildPhases, PhaseDepth)", "commit": "d9dd392" }
      ]
    },
    {
      "version": "v0.1.0",
      "date": "2025-04-18",
      "highlights": [
        { "description": "Protocol Interaction Description Language - a JSON-based DSL for describing protocol choreography that compiles to diagrams" },
        { "description": "Support for OAuth 2.0, PKCE, OIDC, MCP, and A2A protocol examples" },
        { "description": "Three diagram output formats: PlantUML, Mermaid, and Graphviz DOT" }
      ],
      "added": [
        { "description": "Core PIDL library with Protocol, Entity, Flow, and Phase types", "commit": "6555cbb" },
        { "description": "JSON parser with file and reader support", "commit": "6555cbb" },
        { "description": "Validation logic with detailed error reporting", "commit": "6555cbb" },
        { "description": "High-level operations: `ValidateFile`, `ValidateFiles`, `NewMinimalProtocol`, `WriteProtocolFile`", "commit": "6555cbb" },
        { "description": "JSON Schema (draft 2020-12) for PIDL validation", "commit": "61f0a39" },
        { "description": "Embedded JSON Schema for programmatic access", "commit": "61f0a39" },
        { "description": "PlantUML sequence diagram renderer", "commit": "524e920" },
        { "description": "Mermaid sequence diagram renderer", "commit": "524e920" },
        { "description": "Graphviz DOT data flow diagram renderer", "commit": "524e920" },
        { "description": "Renderer interface with format parsing and file extension helpers", "commit": "524e920" },
        { "description": "Embedded protocol examples with API: `List`, `Get`, `GetProtocol`, `GetJSON`", "commit": "66f6aa6" },
        { "description": "OAuth 2.0 Authorization Code flow example", "commit": "66f6aa6" },
        { "description": "OAuth 2.0 + PKCE flow example", "commit": "66f6aa6" },
        { "description": "OpenID Connect Authentication flow example", "commit": "66f6aa6" },
        { "description": "MCP tool invocation flow example", "commit": "66f6aa6" },
        { "description": "A2A agent delegation flow example", "commit": "66f6aa6" },
        { "description": "`pidl validate` command for validating PIDL JSON files", "commit": "8bf725d" },
        { "description": "`pidl generate` command for generating diagrams (PlantUML, Mermaid, DOT)", "commit": "8bf725d" },
        { "description": "`pidl examples` command for listing and showing built-in examples", "commit": "8bf725d" },
        { "description": "`pidl init` command for creating new protocol files from templates", "commit": "8bf725d" }
      ],
      "documentation": [
        { "description": "README with installation, quick start, CLI reference, and library usage", "commit": "45e558b" },
        { "description": "Full PIDL language specification document", "commit": "45e558b" },
        { "description": "Project roadmap with phased implementation plan", "commit": "45e558b" },
        { "description": "UTF-8 icons for README features list", "commit": "e6830b0" }
      ],
      "tests": [
        { "description": "Unit tests for core library: types, parser, validation, operations", "commit": "d448ea7" },
        { "description": "Tests for render package: format parsing, all renderers", "commit": "524e920" },
        { "description": "Tests for examples package: embedding, listing, retrieval", "commit": "66f6aa6" },
        { "description": "60 tests total with full linting compliance", "commit": "d448ea7" }
      ],
      "build": [
        { "description": "Go module initialization", "commit": "284d99a" },
        { "description": "GitHub Actions CI/CD workflows", "commit": "9e7c3af" },
        { "description": "Linting fixes for golangci-lint compliance", "commit": "03e1460" }
      ],
      "infrastructure": [
        { "description": "MIT License", "commit": "bc35c74" },
        { "description": "Gitignore with binary and ideation file patterns", "commit": "284d99a" }
      ]
    }
  ]
}
